export const cities = [
    // منطقة الرياض
    'الرياض', 'الخرج', 'الدوادمي', 'المجمعة', 'القويعية', 'وادي الدواسر', 'الزلفي', 'شقراء', 'عفيف', 'الرين', 'الغاط', 'الدرعية',
    
    // منطقة مكة المكرمة
    'جدة', 'مكة المكرمة', 'الطائف', 'القنفذة', 'الجموم', 'رابغ', 'الليث', 'خليص', 'أضم', 'تربة', 'الخرمة', 'رنية', 'الكامل', 'العرضيات', 'الموية', 'ميسان', 'بحرة',
    
    // المنطقة الشرقية
    'الدمام', 'الخبر', 'الظهران', 'القطيف', 'الأحساء', 'الجبيل', 'الخفجي', 'بقيق',
    
    // منطقة عسير
    'أبها', 'خميس مشيط', 'بيشة', 'محايل عسير', 'بلقرن', 'النماص', 'سراة عبيدة', 'طريب', 'بارق', 'تنومة',
    
    // منطقة تبوك
    'تبوك', 'ضباء', 'حقل', 'أملج', 'الوجه', 'البدع', 'العيينة',
    
    // منطقة نجران
    'نجران', 'شرورة', 'بدر الجنوب', 'يدمة', 'حبونا', 'ثار',
    
    // منطقة القصيم
    'بريدة', 'عنيزة', 'الرس', 'البكيرية', 'المذنب', 'البدائع', 'العيون',
    
    // منطقة الباحة
    'الباحة', 'بلجرشي', 'المندق', 'العقيق', 'قلوة', 'المخواة', 'الحجرة',
    
    // منطقة الحدود الشمالية
    'عرعر', 'طريف', 'العويقيلة', 'رفحاء',
    
    // منطقة الجوف
    'سكاكا', 'دومة الجندل', 'القريات', 'طبرجل',
    
    // منطقة جازان
    'جازان', 'صبيا', 'أبو عريش', 'بيش', 'الدرب', 'العارضة', 'الحرث', 'الطوال', 'فيفاء', 'الموسم', 'الشقيري',
    
    // منطقة المدينة المنورة
    'المدينة المنورة', 'ينبع', 'العلا', 'مهد الذهب', 'خيبر', 'بدر', 'الحناكية', 'العيص', 'وادي الفرع', 'الرايس'
];